# Rebar Crank Type Utils Get Crank Ratio Method

Source: https://www.revitapidocs.com/2026/5b734109-ebe0-219c-4b01-161e2d8b67c4.htm

---

| Rebar Crank Type Utils Get Crank Ratio Method |
| --- |

Gets the crank ratio value.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static double GetCrankRatio(
	Document document,
	ElementId rebarCrankTypeId
)
```

```
Public Shared Function GetCrankRatio (
	document As Document,
	rebarCrankTypeId As ElementId
) As Double
```

```
public:
static double GetCrankRatio(
	Document^ document,
	ElementId^ rebarCrankTypeId
)
```

```
static member GetCrankRatio :
        document : Document *
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

document Document
:   The document.

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.

#### Return Value

Double
Returns the crank ratio value. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |

Remarks The crank slope is 1/crankRatio. See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace